Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja4/sverre-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 4 Davvi Girji 2010 .
nob: Artikkel i boka Samisk skolehistorie 4 . Davvi Girji 2010 .

source: Bieskkenjárggas Varnai
nob: Fra Bieskenjárga til Varna

source: Muitaluvvon Elfrid Boinii
nob: Fortalt til Elfrid Boine

source: Sverre Somby čájeha mo son giddejuvvui giehtaruvddiiguin áidái Kárášjogas .
nob: Sverre Somby viser hvordan han som barn blei lenket til et gjerde i Karasjok .

source: ( Govva : Amund Johnskareng , Min Áigi )
nob: ( Foto : Amund Johnskareng , Min Áigi )

source: Elfrid Boine , 2007 ( Govva : Basia Głowacka )
nob: Elfrid Boine , 2007 ( Foto : Basia Głowacka )

source: Sverre Somby lea riegádan Kárášjogas geasset 1945 .
nob: Sverre Somby er født i Karasjok sommeren 1945 .

source: Son lea bajásšaddan Bieskkenjárggas , gilážis sullii 20 km márkanis .
nob: Han vokste opp i Bieskanjarga , et lite tettsted ca. 20 km fra bygda .

source: Doppe son orui etniinis , oappáinis ja vieljainis .
nob: Der bodde han sammen med mor og to søsken .

source: Su áhčči jámii árrat .
nob: Faren døde tidlig .

source: Sverre lea bargan meara alde , viessogálvosnihkkárin ja dáiddárin .
nob: Sverre har vært sjømann , jobbet som møbelsnekker og kunstner .

source: Daid maŋemuš jagiid son lea bargan Kárášjoga vuođđoskuvllas fágaoahpaheaddjin .
nob: De siste åra har han vært faglærer ved grunnskolen i Karasjok .

source: Jearahalli Elfrid Boine ( r. 1959 ) lea mieldoaimmaheaddji Sámi skuvlahistorjá- girjeráiddus .
nob: Intervjueren Elfrid Boine ( f. 1959 ) er medredaktør i bokserien Samisk skolehistorie .

source: Son lea bajásšaddan Kárášjogas , ja lea leamaš oahpaheaddji vuođđoskuvllas ja ráđđeaddin Finnmárkku fylkkamánni bajásšaddan- ja oahpahusossodagas , ja dál bargá oahpahussekšuvnna jođiheaddjin Meløy gielddas Nordlanddas .
nob: Hun er oppvokst i Karasjok , har vært lærer i grunnskolen og rådgiver hos Fylkesmannen i Finnmark , oppvekst - og utdanningsavdelingen og leder seksjon undervisning i Meløy kommune i Nordland .

source: Mánnávuođa riika
nob: Barndommens rike

source: Sverre muitala mánnávuođa birra Bieskkenjárggas oadjebas- ja friddjavuođas .
nob: Sverre forteller om en sorgløs og fri barndom i Bieskenjarga .

source: Lei friddja eallin iešguđegetlágan doaimmaiguin .
nob: Det var et fritt liv med mange ulike aktiviteter .

source: Árgabeaivi lei dievva astoáiggedoaimmaiguin nugo oaggun , stoahkan ja somás dágut mat ledje čadnon jahkeáigodagaide .
nob: Livet var fylt med fritidsaktiviteter som fiske , lek og morsomme påfunn og arbeid knyttet til årstiden .

source: – Geasset ledjen mielde veahkeheamen lájuin ja dálvet fertiimet buohkat oasálastit muohttaga hoigat ja guoddit muoraid vissui .
nob: - Om sommeren var jeg med og hjalp til med slåttonna og om vinteren måtte alle bidra til med å måke snø og bære inn ved .

source: Ruoktu lei seammálágan go eanaš ruovttut guovllus , eai lean várra nu ollu materialisttalaš dávvirat , muhto ruoktu lei nuppe dáfus devdon stuorrabearraša buriiguin .
nob: Hjemmet var likt de fleste hjem i området , kanskje ikke så velfylt av materielle goder , men på den andre sida fylt av storfamiliens goder .

source: Lei ruoktu gos ledje ollu olbmot , ja lei áigi leat guldaleaddjin go rávisolbmot muitaledje máidnasiid .
nob: Det var et hjem fylt med mange mennesker , og tid til gode historier fortalt av voksne der barna var spente tilhørere .

source: Skuvlaálgin
nob: Skolestart

source: – Dalán maŋŋá mu 7-jagi riegádanbeaivvi , álggii ođđa árgabeaivi mu eallimis .
nob: - Rett etter 7-årsdagen , startet en ny hverdag for meg .

source: Mun álgen mánáidskuvlii Kárášjogas .
nob: Jeg begynte på barneskolen i sentrum i Karasjok .

source: Munnje šattai dát áigi áibbas earálágan go dan friddja eallimii mii mus lei leamaš bearrašiin ovttas .
nob: For meg ble dette en tid som var total annerledes fra det frie livet jeg hadde hatt sammen med familien .

source: Mus lei sámegiella eatnigiellan ja máhtten uhcán dahje ii bálljo dárogiela go bohten skuvlii .
nob: Jeg har samisk som morsmål og kunne lite eller ingenting norsk da jeg kom til skolen .

source: Kárášjogas eai lean galle oahpaheaddji geat hálle sámegiela .
nob: I Karasjok var det ikke mange lærere som snakka samisk .

source: Oahpaheaddji Bardal ja Bjørn Aarseth ovttas Anna Mørkain ledje oahpaheaddjit geat hálddašedje sámegiela álggogeahčen 50 logu .
nob: Sammen med lærer Bardal og Bjørn Aarseth var Anna Mørk de lærerne som i all hovedsak snakka samisk i begynnelsen av 1950-årene .

source: Skuvlla lei ollislažžat dáža institušuvdna gielain maid mun in hálddašan .
nob: Skolen i sin helhet var en norsk institusjon med et språk jeg ikke behersket .

source: Muhto eai galgan mannat go moadde jagi ovdal go ledjen vajálduhttán sámegiela .
nob: Men det skulle ikke ta mange år før jeg hadde glemt samisk .

source: Nugo lei eanaš mánáide geat orro boaittobealde , fertejin orrut internáhtas .
nob: Som de fleste andre barn som bodde utenfor bygda , måtte jeg bo på internatet .

source: Mun defineren iežan skealbma gándan .
nob: Jeg definerer meg selv som skealbma gánda , » en rabagast ” .

source: Ožžon jođánit váttisvuođaid go álgen skuvlii .
nob: Jeg fikk raskt problemer da jeg begynte på skolen .

source: Leigo skuvla ja internáhta mii ii lean heivehuvvon munnje vai ledjengo mun gii in heivehan iežan skuvlii ja internáhtii , dan ii leat buorre dadjat .
nob: Om det var skolen og internatet som ikke var tilpasset meg eller om det var jeg som ikke tilpasset meg skolen og internatet , er ikke godt å si .

source: Skuvllas in oahpan áktánasat , ledje sihke gielalaš ja láhttenvuogi váttisvuođat .
nob: På skolen lærte ikke jeg så mye , det var både språklige og atferdsmessige barrierer .

source: Áidna fága masa liikojin ja mas ohppen , lei risttalašvuohta .
nob: Det eneste faget jeg likte og lærte i , var kristendom .

source: Dan fágas ledje konkrehtalaš oahppanvuogit gos oahpaheaddji geavahii flanellográfa go muitalii biibalhistorjjá .
nob: I det faget var det konkretisering , der læreren brukte flanellograf når hun fortalte bibelhistorier .

source: Earretgo risttalašvuođas de šattai mus uhccán skuvla .
nob: Utover kristendom ble det lite skole på meg .

source: Mus ii lean dat máššu mii gáibiduvvui leat oahppi , čuovvut mielde maid oahpaheaddji dajai ja dáhtui bargat .
nob: Jeg hadde ikke den roen som krevdes for å være elev og følge med på det læreren sa og ba om .

source: Seammálágan dilli lei maid internáhtas .
nob: Det samme gjaldt på internatet .

source: Dan áigge lei dábálaš ráŋggáštit , ja dan mun bessen vásihit .
nob: På den tida var det ikke uvanlig med fysisk straff , noe jeg fikk erfare .

source: Sáhtii leat ahte in beassan olggos , rissehallen , gaiko vuovttaid duohken ja eará fysalaš ráŋggášteamit mat eai geardda beaivečuovgga .
nob: Det kunne være straff i form av husarrest , ris , lugging i håret og annen fysisk avstraffelse , som ikke tåler dagens lys i dag .

source: Gevrejuvvon skuvllas
nob: Bortvist fra skolen

source: Skábman 1954 , 9-jahkásažžan gevrejuvvojin mun ja sáddejuvvojin ruoktot .
nob: Jeg var ikke mange år på skolen før jeg senhøstes 1954 ble utvist og sendt hjem .

source: Skuvla ja internáhta eai nákcen stivret mu .
nob: Skolen og internatet maktet ikke å holde styr på meg .

source: Mun ledjen ruovttus sullii guokte mánu ovdal go fas galgen gullat skuvllas .
nob: Jeg ble hjemme i nesten to måneder før det skjedde noe fra skolefronten .

source: Bohte guokte albmá Bieskkenjárgii , soai leigga ožžon doaibman munno etniin fievrridit márkanii .
nob: Det kom to voksne menn til Bieskenjarga , som hadde fått oppdraget med å frakte meg og min mor til bygda .

source: Soai eaba muitalan manne mun galgen márkanii .
nob: De fortalte ikke hvorfor jeg skulle tas med til bygda .

source: Šattai surgadis fearán 9-jahkásaš gándii , geasa bijaiga vel giehtaruvddiid ovdal go vulggiimet ruovttus .
nob: Det ble en skrekkelig opplevelse for en redd ni-åring , som fikk satt på håndjern før de startet hjemmefra .

source: Lei maŋimuš geardde mun oidnen ruovttu máŋgga jahkái .
nob: Og det var siste gangen jeg så hjemmet på flere år .

source: Go bođiimet márkanii , ijasteimme etniin muhtin oahppása luhtte .
nob: Da vi kom til bygda , overnatta mamma og jeg hos en kjenning av familien .

source: Beaivvi maŋŋá bovdejuvvui eadni čoahkkimii báhpa lusa gii lei skuvlastivrra ovdaolmmoš .
nob: Dagen etterpå ble mamma innkalt til møte hos presten , som var skolestyrets formann .

source: Ovttas suohkanbáhpain oassálasttii čoahkkimii skuvlainspektevra Lydolf Lind Meløy mottiin eará albmáin .
nob: Sammen med sogneprest Kielland deltok også skoleinspektør Lydolf Lind Meløy og noen andre menn på møtet .

source: Dan botta go eadni lei čoahkkimis , ledjen mun goallostuvvon báhpaviesu áidái , mii lea oalle gasku márkana .
nob: Mens mamma var inne , ble jeg lenka til gjerdet ved presteboligen , som ligger ganske så midt i bygda .

source: Das čužžon mun dan botta eadni lei čoahkkimis .
nob: Der sto jeg hele tida mens mamma var i møte .

source: Dál in sáhte áddet manne máná fertejedje viežžat ruovttus ja bidjat giehtaruvddiide .
nob: I etterkant kan jeg ikke skjønne hvorfor et barn måtte hentes hjemmefra og påføres håndjern .

source: Ja in ge ádde manne fertejin goallostuvvot áidái dego beana .
nob: Og jeg skjønner heller ikke hvorfor jeg måtte stå lenka fast til gjerdet som en hund .

source: Dat ii lean buorre dovdu .
nob: Det var ikke en god opplevelse .

source: Mun in leat goassege beassan diehtit mii geavai dan čoahkkimis , muhto in eahpit ahte eadni bággejuvvui vuolláičállit báhpáriid mat duođaštedje ahte mun galgen sirdojuvvot erenoamášskuvlii Mossii .
nob: Jeg har aldri fått vite hva som skjedde der inne på møtet , men ser ikke bort fra at mamma ble tvunget til å skrive under papirene som bekreftet at jeg skulle overflyttes til en spesialskole i Moss .

source: Mátki ođđa árgabeaivái
nob: Reisen til ny hverdag

source: – Guovvamánu 2. beaivvi 1955 lei earru Kárášjogain , etniin ja eallimiin maid dovden .
nob: 2. februar 1955 ble det avskjed med Karasjok , mamma og det livet jeg kjente .

source: Maŋŋá go eadni lei čállán vuollái báhpáriid , ijasteimme maŋemuš ija Kárášjogas , dál muhtin eará oahppása luhtte .
nob: Etter at mamma hadde skrevet under papirene , overnattet vi en natt til i Karasjok , nå hos en annen bekjent av familien .

source: Mátki Mossii lei guhki ja mohkkái .
nob: Turen til Moss var lang og kronglete .

source: Gielda lei doaimmahan munnje mátkeskihpára , ja Fru Isaksen lei jođus Osloi ja šattai mu mátkeskibir boahttevaš jándoriid .
nob: Kommunen hadde ordnet med ledsager . Fru Isaksen skulle på tur til Oslo og ble mitt reisefølge de følgende dagene .

source: Ieš mátki máttás lei miellagiddevaš ja mátkeskibir lei hui šiega ja fiinna nisu , vaikko áddejin ahte in boahtán oaidnit bearraša guhkes áigái .
nob: Ledsageren var ei snill og hyggelig dame . Selve turen nedover var i seg selv spennende , selv om jeg skjønte at jeg ikke ville se familien på lenge .

source: Mátkkošteimme bussiin ja togain Suoma ja Ruoŧa bokte ovdal go bođiime Osloi ja ruovdemáđiistašuvdnii .
nob: Reisen gikk med buss og tog via Finland og Sverige før vi kom til Oslo og jernbanestasjonen .

source: Go olliime dohko , bođii muhtin almmái erenoamášskuvllas .
nob: Da vi kom fram , ble jeg møtt av en mann fra spesialskolen .

source: Dovden ieš ahte ledjen bukton dego poastapáhkka .
nob: Jeg følte selv at jeg ble avlevert som en pakkepost .

source: Skealmmaidskuvla
nob: Skurkeskolen

source: – Dan beaivve go vižžojin Østbanestašuvnnas Oslos , álggii maid badjel golmma jagi deattán .
nob: Den dagen jeg ble hentet på sentralbanen i Oslo , ble også den dagen da over tre års mareritt startet .

source: Skuvlii boahtin lei surgat .
nob: Ankomsten til skolen var forferdelig .

source: Mu givssidedje danin go hállen sámegiela , ja heajos dárogiela .
nob: Jeg ble trakassert for at jeg snakka samisk , og dårlig norsk .

source: Skuvllas jotke mu váttisvuođat .
nob: På skolen fortsatte vanskene for meg .

source: Dán vuoru lei giella mii šattai hehttehussan mu vejolašvuođaide oahppat .
nob: Denne gangen var det språket som ble et hinder for å lære noe .

source: Våk skuvlaruoktu lei heaittihuvvon eanadoalludállu stuorra areálain .
nob: Våk skolehjem var et nedlagt gårdsbruk med store arealer .

source: Skuvla lei Våler gielddas , Moss lahka .
nob: Skolen lå i Våler kommune ved Moss .

source: Skuvla ásahuvvui Varna skuvlaruoktun gánddaide geain ledje váttisvuođat , dahje nugo ieža čilgejedje – skuvlagánddaide geain ledje láhttenváttisvuođat .
nob: Skolen ble etter hvert etablert som Varna skolehjem for vanskeligstilte gutter , eller som de selv definerte det – skole for gutter med atferdsproblemer .

source: Oktiibuot ledje gaskal 40 ja 50 gándda skuvllas .
nob: Totalt var det mellom 40 og 50 gutter på skolen .

source: Mun ođđen ovtta dan guovtti oađđinsálas ja muittán ain hája oađđinsálas .
nob: Jeg lå på en av de to sovesalene og kan enda huske lukta fra sovesalen .

source: Máŋggas gánddain gužže seŋgii , ja ii lean oktage gii divššui sin seamma láhkai go ruovttus .
nob: Mange av guttene var sengevætere , og det var ikke noen som stelte for dem på samme måte som hjemme .

source: Nu ahte seaŋggat ledje durdon guččain ja aktonas mánáid gatnjaliiguin .
nob: Så sengene var nokså inngrodd med både urin og tårer fra ensomme barn .

source: Ulbmil lei ahte gánddat skuvllas galge oahppat oahpahusa ja dálu aktivitehtaid bokte .
nob: Meninga var at guttene på skolen skulle lære gjennom undervisning og aktiviteter på gården .

source: Skuvllas ledje dušše gánddat gaskal 7-21 jagi .
nob: Skolen var en ren gutteskole for aldersgruppen 7–21 år .

source: Sihke skuvla ja internáhta lei seammá guovllus .
nob: Både skolen og internatet var i samme område .

source: Skuvlla oktavuođas lei stuorra návet ja giettit .
nob: I tilknytning til skolen var det et stort fjøs og åkre .

source: Mii fertiimet veahkehit earret eará buđetrájuin , ja eará doaimmaiguin mat gulle šibit- ja eanandollui .
nob: Vi måtte hjelpe til med potetinnhøstinga og andre aktiviteter som var knyttet til fjøs og jordbruk .

source: Jos lei dárbu , de sáddejuvvuimet dáluide lahkosis veahkehit buđetrájuin .
nob: Om det var behov for det , ble vi sendt rundt på gårdene for å hjelpe til med potetinnhøstinga .

source: Mii eat ožžon mávssu dán ovddas , ja soittii vel nu ahte skuvla anii ávkki min barggus dáluin .
nob: Vi fikk ikke noe betalt for det , og jeg ser ikke bort fra at det var skolen som nøt godt av våre tjenester på gårdene .

source: Go geavaheimmet nu olu áiggi dáluin birrasis , dat dagahii ahte ii šaddan nu olu áigi skuvlabargguide .
nob: Ved at vi måtte bruke mye av vår tid til arbeid på gårdene , ble det heller ikke så mye tid til skole .

source: Munnje , gii in lean oahpan nu olu skuvllas Kárášjogas , šattai sirdin Varnai dušše duođaštus dasa ahte mu skuvlavázzin gárttai váilevaš .
nob: For meg som ikke hadde lært så mye på skolen i Karasjok , ble overflyttinga til Varna bare en stadfesting på at skolegangen min ble mangelfull .

source: Varna skuvla lei duođai skealmmaid šaddadanskuvla .
nob: Varna skole var regelrett en avlsskole for å skape kjeltringer .

source: Lei gievrramus riekti mii ráđđii sihke skuvllas ja internáhtas .
nob: Det ble den sterkestes rett som rådet i både skolen og internatet .

source: Veahkaválddálašvuohta , sadisma , seksuálalaš illásteapmi lei dábálaš sihke boarrásat ohppiid ja doaibmaolbmuid gaskkas .
nob: Vold , sadisme , sexmisbruk fra både eldre elever og funksjonærer var vanlig .

source: Ii lean veara muitalit dan birra mii lei dáhpáhuvvan , lei ulmmeheapmi .
nob: Å si i fra om det som skjedde , var meningsløst .

source: Dat dagahii ráŋggášteami , ja lei dábálaš huškkohallat eará ohppiide ja doaibmaolbmuide .
nob: Det utløste gjerne straff , og det var vanlig å få juling fra både elever og funksjonærer .

source: Doaibmaolbmuid ráŋggáštanvuogit sáhtte leat ealnnjehasat , juoga maid vásihin máŋgii .
nob: Straffemetodene til funksjonærene kunne være avskyelige , noe jeg opplevde mange ganger .

source: Máŋgii lohkkadedje mu latnji keallárii .
nob: Jeg ble flere ganger låst inne i et rom i kjelleren .

source: Ovdamearka mo mii ráŋggáštuvvuimet rávisolbmuide , lei dalle go mun časken ovtta doaibmaalbmá bártni .
nob: Et eksempel på hvordan vi ble behandlet av de voksne , var resultat av da jeg slo til en av funksjonærsønnene .

source: Ráŋggášteapmi mu vuostá šattai dalle ahte vedde mu kealláris sullii golbma vahku .
nob: Som straff ble jeg tjora fast i kjelleren i ca. 3 uker .

source: Báddi darvánii mu gorudii , ja sii fertejedje gaikut dan luovus .
nob: Tauet satte seg fast i kroppen , og måtte rives løs .

source: Mus leat otnábeaivvi mearkkat dan ráŋggášteami maŋŋá .
nob: Jeg har enda merker etter det kjelleroppholdet .

source: Okta leat dat fysalaš mearkkat maid ožžon dan áigge go ledjen máddin .
nob: En ting er de fysiske merkene jeg ble påført den tida jeg var elev der sørpå .

source: Eará leat dat hávit mat leat darvánan millii ja sillui .
nob: Noe annet er alle de sårene som har satt seg i sinn og psyke .

source: Neahtas gávdnojit ollu dieđut mo lei Varna skuvlaruovttus .
nob: Det fins mye informasjon om forholdene på Varna skolehjem på nettet .

source: NRK Østland-sáddagiin lea reportáša Varna birra gos ovddeš oahpaheaddji muitala dilálašvuođa birra skuvllas .
nob: NRK Østlandssendingen har en reportasje om Varna der en tidligere lærer forteller om forholdene på skolen .

source: « Henning Karlstad lei oahpaheaddji Våk skuvlaruovttus dalle go skuvla molssui nama Varnan 1950-logus ... Maŋŋá barggai son erenoamášpedagogihkain oahpahusdepartemeanttas ja vuolitdirektevran Oslo biiregiddagasas .
nob: " Henning Karlstad var lærer på Våk skolehjem , da skolen skiftet navn til Varna på 1950-tallet. ... Senere jobbet han med spesialpedagogikk i undervisningsdepartementet og som underdirektør ved Oslo kretsfengsel .

source: Son govvida skuvlaruovttu dego mánáidgiddagasa : - Maŋemuš jagiin ja maŋŋá go lean oaidnán vugiid mo gieđagušše olbmuid , de in eahpit gohčodit Våk mánáidgiddagasain .
nob: Han beskriver skolehjemmet som et barnefengsel : – I modne år og etter å ha sett en del måter å behandle mennesker på , så nøler jeg ikke med å kalle Våk et barnefengsel .

source: Deháleamos lei doallat ortnega ja systema , oahppu bođii nubbin.»[1 ]
nob: Det viktigste var å holde orden og system , kunnskapene kom i annen rekke."[1 ]

source: Norgga erenoamášskuvllaid várdosis čilgejuvvo Varna dán láhkái:Varna skuvla , Sperrebotn .
nob: I en oversikt over spesialskoler i Norge blir Varna skole beskrevet på følgende måte:Varna skole , Sperrebotn .

source: Gánddat láhtenváttisvuođain .
nob: Gutter med atferdsvansker .

source: Våk skolehjem ( skuvlaruoktu ) rahppui 15.12.1909 ovttasbargoprošeaktan 60 % stáhta ja 40 % gielda doaibman .
nob: Våk skolehjem ble åpnet 15.12.1909 som et samarbeidsprosjekt med 60 % statlig og 40% kommunal drift .

source: 1951 erenoamášskuvlalága oktavuođas molsašuvai namma « Varna skole for barn med tilpasningsvansker » ( Varna skuvla mánáide geain leat heivehanváttisvuođat ) .
nob: I forbindelse med spesialskoleloven av 1951 ble navnet endret til Varna skole for barn med tilpasningsvansker .

source: Stáhta válddii badjelasat buot goluid , muhto gielddas lei ovddasvástádus skuvlii gitta 1970 rádjai .
nob: Staten overtok etter hvert alle utgifter , men kommunen hadde noe myndighet helt frem til 1970 .

source: Dalle molsašuvai namma « Varna offentlige skole » ( Varna almmolaš skuvla ) .
nob: Da ble navnet endret til Varna offentlige skole .

source: Dego eará KUD:ii gullevaš stáhta skuvllain sihkkojuvvui namma « offentlige » 1977:as , ja de šattai namma « Varna skole » .
nob: Som ved andre statlige skoler under KUD ble ordet offentlig strøket i 1977 , og navnet ble da Varna skole .

source: Skuvla loahpahuvvui 01.08.1992.[2 ]
nob: Skolen ble nedlagt 01.08.1992.[2 ]

source: Oktavuohta ruovttuin
nob: Kontakt med hjemmet

source: – Dan botta go ledjen oahppin skuvllas , lei mus uhcán oktavuohta etniin .
nob: Mens jeg var elev på skolen , hadde jeg lite kontakt med mamma .

source: Ii lean telefovdna ruovttus , ja skuvlla njunnožat eai beroštan jos mun dahje dat eará gánddat eat beassan doallat oktavuođa iežamet lagamusaide .
nob: Det var ikke telefon hjemme , og skolens ledelse sørga heller ikke for at jeg og de andre guttene fikk holde kontakt med familien .

source: Lihkus lei mus dássedit oktavuohta Láilá-oappáin .
nob: Heldigvis hadde jeg jevnlig kontakt med min søster Laila .

source: Son čálii reivviid munnje , ja muitalii ságaid das mii geavai Kárášjogas .
nob: Hun skrev brev til meg , og holdt meg orientert om det som skjedde i Karasjok .

source: Áidna gii finai guossis lei Isak Østmo , ovddeš oahpaheaddji Kárášjogas .
nob: Den eneste som besøkte meg på skolen , var Isak Østmo , en lærer fra Karasjok .

source: Son lei oktii skuvllas mu guossis , muhto munnje lei buorre sámástit , ja vel suinna gii dovddai mu ja mu bearraša .
nob: Han var på skolen en gang , men for meg ble det godt å få prate samisk , og med en som kjente meg og min familie .

source: Geasset 1958 johten mu okto Mossas Kárášjohkii .
nob: Sommeren 1958 reiste jeg alene fra Moss til Karasjok .

source: Dán vuoru dovden iežan roahkkadin , ja ii lean váttis johtit okto dál go hálddašin dárogiela .
nob: Denne gangen følte jeg meg tøff , det var ikke problemer å reise nå som jeg beherska norsk .

source: Mátki lei guhki , ja álggos togain Oslos Troandimii ja das jotkkii mu mátki Hurtigrutain Hámmárfestii .
nob: Reisen var lang , og starta med tog til Trondheim , før jeg fortsatte reisen med hurtigruta til Hammerfest .

source: Mun deiven Mákká Kirstte gii gárttai mu mátkeskibirin Hámmárfeasttas Kárášjohkii .
nob: Jeg traff på Kirsten Larsen , som ble mitt reisefølge fra Hammerfest til Karasjok .

source: Oanehis ja hohppos geasi maŋŋá , fertejin fas máhccat skuvlii .
nob: Etter en kort og hektisk sommer , måtte jeg reise tilbake til skolen .

source: Jagis nubbái , eai lean nu stuorra rievdamat .
nob: Fra det ene året til det andre , var det ikke store forandringer .

source: Sii oidne ain min bargin ja rávisolbmot hoidejedje min garragieđain .
nob: Vi ble fortsatt behandlet som arbeidere og ble styrt med jernhånd av de voksne .

source: In dán ge skuvlajagi beassan skuvlla vázzit , šadden eanáš bargat dálus , ja ráŋggáštuvvojin sihke smávva ja stuorra fearániin maidda ledjen oasálastán .
nob: Heller ikke det siste skoleåret fikk jeg fikk særlig skole , det ble mest arbeid på gården og straff for små og store episoder som jeg var med på .

source: Soames háve lei ráŋggáštus vuoiggalaš , eará háve ii .
nob: Noen ganger var straffen berettiget , andre ganger uberettiget .

source: De álggii juohkebeaivválaš eallin fas máŋga jagi maŋŋá gánddaruovttus .
nob: Så begynte hverdagen etter mange år på guttehjem .

source: Easkka geasset 1959 máhccen ruoktot .
nob: Først sommeren 1959 kom jeg hjem for godt .

source: Dalle ledjen leamaš eret badjel golbma jagi .
nob: Da hadde jeg vært borte i over tre år .

source: Boađus mu jagiin Varna gánddaidruovttus lei ahte mun ledjen massán eatnigiela oalát ja hállen dušše dárogiela .
nob: Resultatet av mine år på Varna guttehjem var at jeg hadde mista morsmålet mitt og snakka bare norsk .

source: Manai measta jahkebealle ovdal go fas hállen sámegiela albmaláhkai .
nob: Det gikk nesten et halvt år før jeg snakka samisk skikkelig .

source: Mun ledjen oahppan ollu vugiid birget skealbma gándan , muhtto in vel máhttán nu ollu das maid ledjen galgat skuvllas leat oahppan .
nob: Jeg hadde lært mange triks for å klare meg som pøbel , og fortsatt kunne jeg ikke så mye av det jeg skulle kunne på skolen .
